app/controllers/courses_controller.rb

	def index
       @courses=Course.all
---
SELECT "courses".* FROM "courses" WHERE (content like '%吳文傑%')

	def show
    @course=Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", nil]]

	def create

     @course=Course.new(course_params)
	if @course.save
---
INSERT INTO "courses" ("title", "teacher", "time", "place", "credit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "遊戲"], ["teacher", "我"], ["time", "晚上"], ["place", "家裡"], ["credit", "2"], ["created_at", "2015-04-07 11:20:27.036581"], ["updated_at", "2015-04-07 11:20:27.036581"]]

    def edit
	@course=Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 5]]

    def update
	@course=Course.find(params[:id])
       if @course.update(course_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "courses" SET "place" = ?, "credit" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["place", "2"], ["credit", "2"], ["updated_at", "2015-04-07 11:20:01.517197"], ["id", 5]]

    def destroy
    	@course=Course.find(params[:id])
    	@course.destroy
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]